In [1]:
import pandas as pd
import numpy as np

In [2]:
dtypes = {
    "county": "category",
    "state": "category",
    "total_violent_crime": "int64",
    "household_income": "int64",
}

In [3]:
data_clean = pd.read_csv("Income_VS_State.csv")

In [4]:
data_clean.tail()

        county state  total_violent_crime  household_income
2402      Ohio    IN                    4             50377
2403    Newton    MS                    5             39190
2404   Jerauld    SD                    5             46591
2405  Cimarron    OK                    3             38301
2406  Lawrence    MS                    0             38393

In [5]:
df = data_clean

In [6]:
df = df.drop(["county"], axis = 1)

In [7]:
df.head()

  state  total_violent_crime  household_income
0    MO                28499             34582
1    IL                  407             26972
2    TX                   19             43438
3    MD                38950             41385
4    TN                60653             46250

In [8]:
print(df)

     state  total_violent_crime  household_income
0       MO                28499             34582
1       IL                  407             26972
2       TX                   19             43438
3       MD                38950             41385
4       TN                60653             46250
...    ...                  ...               ...
2402    IN                    4             50377
2403    MS                    5             39190
2404    SD                    5             46591
2405    OK                    3             38301
2406    MS                    0             38393

[2407 rows x 3 columns]

In [9]:
df.to_csv("output1.csv", index=False)